vlm/base/Documents/бит_АктОБраке.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>бит_АктОБраке</Name>
			<Comment>ЛТ9.2</Comment>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.бит_БракВозвратСрезкаПродукции</xr:Item>
				<xr:Item>InformationRegister.бит_ИсторияИзмененийСсогласованияАктовОБраке</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.бит_СтатусыОБраке</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Цех</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктураПредприятия</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Участок</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктураПредприятия</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Смена</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.СменноеЗадание</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СменныйМастер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОперацияОбнаружения</Name>
					<Type>
						<v8:Type>cfg:EnumRef.бит_ОперацияОбнаружения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗаказНаПроизводство</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаказНаПроизводство2_2</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидОтхода</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Примечание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>500</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НачатоСогласование</Name>
					<Comment>Первыйбит ЛТ24 ЛапшовГ "GVLapshov@1cbit.ru" 06.012.2024</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДоступностьФормы</Name>
					<Comment>Первыйбит ЛТ24 ЛапшовГ "GVLapshov@1cbit.ru" 06.012.2024</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаУстановкиСтатуса</Name>
					<Comment>Первыйбит ЛТ24 ЛапшовГ "GVLapshov@1cbit.ru" 06.012.2024</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаРегистрацииСтатуса</Name>
					<Comment>Первыйбит ЛТ24 ЛапшовГ "GVLapshov@1cbit.ru" 06.012.2024</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТекущийСтатус</Name>
					<Comment>Первыйбит ЛТ24 ЛапшовГ "GVLapshov@1cbit.ru" 06.012.2024</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.бит_СтатусыОБраке</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УспешностьСогласования</Name>
					<Comment>Первыйбит ЛТ24 ЛапшовГ "GVLapshov@1cbit.ru" 06.012.2024</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Исполнитель</Name>
					<Comment>Первыйбит ЛТ24 ЛапшовГ "GVLapshov@1cbit.ru" 06.012.2024</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИтогоКУдержаниюВосстановление</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИтогоКУдержаниюОтходы</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИтогоКУдержаниюПеремаркировка</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбщийУщербКУдержанию</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>6</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ДанныеОБраке</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сотрудник</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
								<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидНесоответствия</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.бит_ВидыНесоответствия</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Отходы</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Восстановление</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Виновник</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Отходы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Материал</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПрямыеЗатраты</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтоимостьВозможногоИспользования</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаПлановоУчетная</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаВозможногоИспользования</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КУдержанию</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Восстановление</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Материал</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидОперации</Name>
							<Type>
								<v8:Type>cfg:EnumRef.бит_ВидыОперацийВосстановления</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ПричиныБрака</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ПричинаБрака</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.бит_ПричиныБрака</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Пояснение</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>200</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Перемаркировка</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>НоменклатураЗабракованная</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПеремаркированоВ</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>6</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПолнаяСебестоимостьЗабракованнойНоменклатуры</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПолнаяСебестоимостьПеремаркированнойНоменклатуры</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КУдержанию</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

vlm/base/AccumulationRegisters/ПлановыеТрудозатраты.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<AccumulationRegister>
		<Properties>
			<Name>ПлановыеТрудозатраты</Name>
			<RegisterType>Turnovers</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Стоимость</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ДенежнаяСуммаЛюбогоЗнака</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СтоимостьРегл</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ДенежнаяСуммаЛюбогоЗнака</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ПериодЗатрат</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Калькуляция</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ПлановаяКалькуляция2_2</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПартияСпецификация</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЭтапПроизводства2_2</v8:Type>
						<v8:Type>cfg:CatalogRef.РесурсныеСпецификации</v8:Type>
						<v8:Type>cfg:DocumentRef.ПроизводствоБезЗаказа</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктураПредприятия</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СтатьяКалькуляции</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтатьиКалькуляции</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидРабот</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыРаботСотрудников</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

vlm/base/Documents/бит_АктОБраке/Forms/ФормаДокумента/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	//Первыйбит ЛТ24 ЛапшовГ "GVLapshov@1cbit.ru" 06.12.2024 +
	Если Объект.Статус.Пустая() Тогда
		
		Объект.Статус = Перечисления.бит_СтатусыОБраке.АктСформированСК;  
		Объект.ТекущийСтатус = Перечисления.бит_СтатусыОБраке.АктСформированСК; 
		
	КонецЕсли;  
	
	Объект.ТекущийСтатус = Объект.Статус;
	
	Если РольДоступна("бит_КонтрольКачестваЧтение") Тогда 
		Элементы.бит_ПринятьВРаботу.Доступность = Ложь;	 
	КонецЕсли; 
	
	Если Объект.Ссылка.Пустая() Тогда
		Объект.УспешностьСогласования = 1;	 
	КонецЕсли;	 
	
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект); 
	//Первыйбит ЛТ24 ЛапшовГ "GVLapshov@1cbit.ru" 06.12.2024 -
		
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)

	//Первыйбит ЛТ24 ЛапшовГ "GVLapshov@1cbit.ru" 06.12.2024 +
	бит_ПроверкаДоступностиОбьекта();
	ПодключаемыеКомандыКлиент.НачатьОбновлениеКоманд(ЭтотОбъект); 
	//Первыйбит ЛТ24 ЛапшовГ "GVLapshov@1cbit.ru" 06.12.2024 -

КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
	
КонецПроцедуры

&НаКлиенте 
Процедура Подключаемый_ВыполнитьКоманду(Команда) 
	//Первыйбит ЛТ24 ЛапшовГ "GVLapshov@1cbit.ru" 06.12.2024 +
	ПодключаемыеКомандыКлиент.ВыполнитьКоманду(ЭтотОбъект, Команда, Объект); 
	//Первыйбит ЛТ24 ЛапшовГ "GVLapshov@1cbit.ru" 06.12.2024 -
КонецПроцедуры 

&НаСервере 
Процедура Подключаемый_ВыполнитьКомандуНаСервере(Контекст, Результат) 
	//Первыйбит ЛТ24 ЛапшовГ "GVLapshov@1cbit.ru" 06.12.2024 +
	ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, Контекст, Объект, Результат); 
	//Первыйбит ЛТ24 ЛапшовГ "GVLapshov@1cbit.ru" 06.12.2024 -
КонецПроцедуры

&НаКлиенте 
Процедура Подключаемый_ОбновитьКоманды()
	//Первыйбит ЛТ24 ЛапшовГ "GVLapshov@1cbit.ru" 06.12.2024 +
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект); 
	//Первыйбит ЛТ24 ЛапшовГ "GVLapshov@1cbit.ru" 06.12.2024 -
КонецПроцедуры 

&НаКлиенте 
Процедура Подключаемый_ВыполнитьКомандуПечати(Команда) 
	 
	//Первыйбит ЛТ9.9 ЛапшовГ "GVLapshov@1cbit.ru" 14.03.2025 +
	УправлениеПечатьюКлиент.ВыполнитьПодключаемуюКомандуПечати(Команда, ЭтаФорма, Объект);
	//Первыйбит ЛТ9.9 ЛапшовГ "GVLapshov@1cbit.ru" 14.03.2025 -
	
КонецПроцедуры  

&НаКлиенте
Процедура бит_ПринятьВРаботу(Команда)
	//Первыйбит ЛТ24 ЛапшовГ "GVLapshov@1cbit.ru" 06.12.2024 +
	бит_ПринятьВРаботуНаСервере();
	бит_ПроверкаДоступностиОбьекта();
	//Первыйбит ЛТ24 ЛапшовГ "GVLapshov@1cbit.ru" 06.12.2024 -
КонецПроцедуры   

&НаСервере
Процедура бит_ПринятьВРаботуНаСервере();
	//Первыйбит ЛТ24 ЛапшовГ "GVLapshov@1cbit.ru" 06.12.2024 +
	Объект.ДатаРегистрацииСтатуса = ТекущаяДатаСеанса();  
	Объект.ДоступностьФормы = Истина;
	ДополнитьЗадачу();
	//Первыйбит ЛТ24 ЛапшовГ "GVLapshov@1cbit.ru" 06.12.2024 -
КонецПроцедуры	

&НаСервере
Процедура ДополнитьЗадачу()
	//Первыйбит ЛТ24 ЛапшовГ "GVLapshov@1cbit.ru" 06.12.2024 +
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЗадачаИсполнителя.Ссылка КАК Ссылка
		|ИЗ
		|	Задача.ЗадачаИсполнителя КАК ЗадачаИсполнителя
		|ГДЕ
		|	ЗадачаИсполнителя.Предмет = &Ссылка
		|
		|УПОРЯДОЧИТЬ ПО
		|	ЗадачаИсполнителя.Дата УБЫВ";
	
	Запрос.УстановитьПараметр("Ссылка", Объект.Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	Если ВыборкаДетальныеЗаписи.Количество() > 0 Тогда
		ВыборкаДетальныеЗаписи.Следующий();  
		ТекущаяЗадача = ВыборкаДетальныеЗаписи.Ссылка.ПолучитьОбъект();
		ТекущаяЗадача.ПринятаКИсполнению = Истина;
		ТекущаяЗадача.ДатаПринятияКИсполнению = ТекущаяДатаСеанса();  
	КонецЕсли;
    //Первыйбит ЛТ24 ЛапшовГ "GVLapshov@1cbit.ru" 06.12.2024 -		
КонецПроцедуры	

&НаКлиенте                       
Процедура бит_ПроверкаДоступностиОбьекта()
	//Первыйбит ЛТ24 ЛапшовГ "GVLapshov@1cbit.ru" 06.12.2024 +
	Если Не Объект.ДоступностьФормы и Объект.Проведен Тогда
		Элементы.ГруппаШапка.Доступность = Ложь;
		Элементы.Страницы.Доступность = Ложь;
	Иначе
		Элементы.ГруппаШапка.Доступность = Истина;
		Элементы.Страницы.Доступность = Истина;
	КонецЕсли;
	 
	Если Объект.Проведен Тогда
		Элементы.бит_ПринятьВРаботу.Доступность = Истина;
	Иначе 
		Элементы.бит_ПринятьВРаботу.Доступность = Ложь;
	КонецЕсли;		 
	//Первыйбит ЛТ24 ЛапшовГ "GVLapshov@1cbit.ru" 06.12.2024 -
КонецПроцедуры 

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	//Первыйбит ЛТ24 ЛапшовГ "GVLapshov@1cbit.ru" 06.12.2024 +
	Если  ПараметрыЗаписи.РежимЗаписи = РежимЗаписиДокумента.Проведение Тогда
		Объект.ДоступностьФормы = Ложь;
		бит_ПроверкаДоступностиОбьекта(); 
		Объект.ДатаУстановкиСтатуса = ЗначениеДаты();
	КонецЕсли;   
	//Первыйбит ЛТ24 ЛапшовГ "GVLapshov@1cbit.ru" 06.12.2024 -
КонецПроцедуры 

&НаСервере
Функция ЗначениеДаты()
	//Первыйбит ЛТ24 ЛапшовГ "GVLapshov@1cbit.ru" 06.12.2024 +
	Возврат ТекущаяДатаСеанса();
	//Первыйбит ЛТ24 ЛапшовГ "GVLapshov@1cbit.ru" 06.12.2024 -
КонецФункции	

&НаКлиенте
Процедура СменаПриИзменении(Элемент)
	//Первыйбит ЛТ24 ЛапшовГ "GVLapshov@1cbit.ru" 06.12.2024 +
	Объект.СменныйМастер = ПолучитьНачальникаСмены(Объект.Смена);   
	//Объект.бит_Сотрудник = ПолучитьСменуПоЗаданию(Объект.бит_Смена); 
	//Первыйбит ЛТ24 ЛапшовГ "GVLapshov@1cbit.ru" 06.12.2024 -
КонецПроцедуры   

&НаСервере
Функция ПолучитьНачальникаСмены(Задание)  
	//Первыйбит ЛТ24 ЛапшовГ "GVLapshov@1cbit.ru" 06.12.2024 +
	//Возврат Задание.бит_НачальникСмены; 
	//Первыйбит ЛТ24 ЛапшовГ "GVLapshov@1cbit.ru" 06.12.2024 -
КонецФункции

&НаКлиенте
Процедура ДанныеОБракеНоменклатураПриИзменении(Элемент)
	   //Первыйбит ЛТ24 ЛапшовГ "GVLapshov@1cbit.ru" 06.12.2024 +
   ТекущаяСтрока = Элементы.ДанныеОБраке.ТекущиеДанные;	
   Объект.ЗаказНаПроизводство = ПолучитьЗаказНаПроизводствоНаСервере(ТекущаяСтрока.Номенклатура);
   //ТекущаяСтрока.бит_Артикул = ПолучитьАртикулНаСервере(ТекущаяСтрока.бит_Номенклатура);
   ТекущаяСтрока.Сотрудник = ПолучитьСотрудникаНаСервере(ТекущаяСтрока.Номенклатура);
   //ТекущаяСтрока.бит_ЕдиницаИзмерения = ПолучитьЕденицуИзмеренияНаСервере(ТекущаяСтрока.бит_Номенклатура);
   //Первыйбит ЛТ24 ЛапшовГ "GVLapshov@1cbit.ru" 06.12.2024 -
                           
КонецПроцедуры

&НаКлиенте
Процедура ДанныеОБракеНоменклатураНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
		//Первыйбит ЛТ24 ЛапшовГ "GVLapshov@1cbit.ru" 06.12.2024 +
	СтандартнаяОбработка = Ложь;
	Если ЗначениеЗаполнено(Объект.Смена) Тогда
		
		
		НоменклатураОтбора = ПолучитьНоменклатуруОтбораНаСервере();
		
		ФормаВыбора = ПолучитьФорму("Справочник.Номенклатура.ФормаВыбора",, Элемент);
		
		ЭлементОтбора = ФормаВыбора.Список.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		ЭлементОтбора.ЛевоеЗначение     = Новый ПолеКомпоновкиДанных ("Ссылка");
		ЭлементОтбора.ВидСравнения      = ВидСравненияКомпоновкиДанных.ВСписке;
		ЭлементОтбора.ПравоеЗначение     = НоменклатураОтбора;
		ЭлементОтбора.Использование      = Истина;
		ЭлементОтбора.РежимОтображения     = РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный;
		
		ФормаВыбора.Открыть();	
	Иначе
		ТекстСообщения = "Сменное задание не выбрано!";
		ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения);
	КонецЕсли;
	//Первыйбит ЛТ24 ЛапшовГ "GVLapshov@1cbit.ru" 06.12.2024 -	

КонецПроцедуры  

&НаСервере
Функция ПолучитьЗаказНаПроизводствоНаСервере(Номенклатура)  
	//Первыйбит ЛТ24 ЛапшовГ "GVLapshov@1cbit.ru" 06.12.2024 +
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПроизводственнаяОперация2_2.Этап.Распоряжение КАК ЭтапРаспоряжение
		|ИЗ
		|	Документ.ПроизводственнаяОперация2_2 КАК ПроизводственнаяОперация2_2
		|ГДЕ
		|	ПроизводственнаяОперация2_2.СменноеЗадание = &СменноеЗадание";
	
	Запрос.УстановитьПараметр("СменноеЗадание", Объект.Смена);
	
	РезультатЗапроса = Запрос.Выполнить().Выбрать();
	РезультатЗапроса.Следующий();
	
	Возврат РезультатЗапроса.ЭтапРаспоряжение;
	//Первыйбит ЛТ24 ЛапшовГ "GVLapshov@1cbit.ru" 06.12.2024 -		
КонецФункции   

&НаСервере                                                              
Функция ПолучитьСотрудникаНаСервере(Номенклатура)  
	//Первыйбит ЛТ24 ЛапшовГ "GVLapshov@1cbit.ru" 06.12.2024 +
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПроизводственнаяОперация2_2.Исполнитель КАК Исполнитель
		|ИЗ
		|	Документ.ПроизводственнаяОперация2_2.ВыходныеИзделия КАК ПроизводственнаяОперация2_2ВыходныеИзделия
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ПроизводственнаяОперация2_2 КАК ПроизводственнаяОперация2_2
		|		ПО ПроизводственнаяОперация2_2ВыходныеИзделия.Ссылка = ПроизводственнаяОперация2_2.Ссылка
		|ГДЕ
		|	ПроизводственнаяОперация2_2.СменноеЗадание = &СменноеЗадание
		|	И ПроизводственнаяОперация2_2ВыходныеИзделия.Номенклатура = &Номенклатура";
	
	Запрос.УстановитьПараметр("СменноеЗадание", Объект.Смена);
	Запрос.УстановитьПараметр("Номенклатура", Номенклатура);
	
	РезультатЗапроса = Запрос.Выполнить().Выбрать();
	РезультатЗапроса.Следующий();
	
	Возврат РезультатЗапроса.Исполнитель;
    //Первыйбит ЛТ24 ЛапшовГ "GVLapshov@1cbit.ru" 06.12.2024 -   	
КонецФункции

&НаСервере
Функция ПолучитьНоменклатуруОтбораНаСервере()  
	//Первыйбит ЛТ24 ЛапшовГ "GVLapshov@1cbit.ru" 06.12.2024 +
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПроизводственнаяОперация2_2ВыходныеИзделия.Номенклатура.Ссылка КАК Ссылка
		|ИЗ
		|	Документ.ПроизводственнаяОперация2_2.ВыходныеИзделия КАК ПроизводственнаяОперация2_2ВыходныеИзделия
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ПроизводственнаяОперация2_2 КАК ПроизводственнаяОперация2_2
		|		ПО ПроизводственнаяОперация2_2ВыходныеИзделия.Ссылка = ПроизводственнаяОперация2_2.Ссылка
		|ГДЕ
		|	ПроизводственнаяОперация2_2.СменноеЗадание = &СменноеЗадание";
	
	Запрос.УстановитьПараметр("СменноеЗадание", Объект.Смена);
	
	РезультатЗапроса = Запрос.Выполнить().Выгрузить();
	НоменклатураОтбора = РезультатЗапроса.ВыгрузитьКолонку("Ссылка");
	СписокЗначений = Новый СписокЗначений;
	СписокЗначений.ЗагрузитьЗначения(НоменклатураОтбора);
    Возврат СписокЗначений;
    //Первыйбит ЛТ24 ЛапшовГ "GVLapshov@1cbit.ru" 06.12.2024 -	
КонецФункции

&НаСервере
Функция ПолучитьСотрудниковОтбораНаСервере()  
	//Первыйбит ЛТ24 ЛапшовГ "GVLapshov@1cbit.ru" 06.12.2024 +
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПроизводственнаяОперация2_2.Исполнитель КАК Исполнитель
		|ИЗ
		|	Документ.ПроизводственнаяОперация2_2 КАК ПроизводственнаяОперация2_2
		|ГДЕ
		|	ПроизводственнаяОперация2_2.СменноеЗадание = &СменноеЗадание";
	
	Запрос.УстановитьПараметр("СменноеЗадание", Объект.Смена);
	
	РезультатЗапроса = Запрос.Выполнить().Выгрузить();
	СотрудникиОтбора = РезультатЗапроса.ВыгрузитьКолонку("Исполнитель");
	СписокЗначений = Новый СписокЗначений;
	СписокЗначений.ЗагрузитьЗначения(СотрудникиОтбора);
    Возврат СписокЗначений;
    //Первыйбит ЛТ24 ЛапшовГ "GVLapshov@1cbit.ru" 06.12.2024 -	
КонецФункции

&НаКлиенте
Процедура ДанныеОБракеПриИзменении(Элемент)
	
	//Первыйбит ЛТ24 ЛапшовГ "GVLapshov@1cbit.ru" 06.12.2024 +
	Для Каждого Элемент из Объект.ДанныеОБраке Цикл
		Если Элемент.Виновник = Неопределено Тогда
			Элемент.Виновник = "Не выявлен";
		КонецЕсли;
	КонецЦикла;
	//Первыйбит ЛТ24 ЛапшовГ "GVLapshov@1cbit.ru" 06.12.2024 -

КонецПроцедуры

&НаКлиенте
Процедура ОтходыКоличествоПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.Отходы.ТекущиеДанные;
	ТекущиеДанные.СуммаВозможногоИспользования = ТекущиеДанные.Количество * ТекущиеДанные.СтоимостьВозможногоИспользования;
	ТекущиеДанные.СуммаПлановоУчетная = ТекущиеДанные.Количество * ТекущиеДанные.ПрямыеЗатраты;
	
	ТекущиеДанные.КУдержанию = ТекущиеДанные.СуммаПлановоУчетная -  ТекущиеДанные.СуммаВозможногоИспользования;
	
КонецПроцедуры

&НаКлиенте
Процедура ОтходыСтоимостьВозможногоИспользованияПриИзменении(Элемент)
	//ТекущиеДанные = Элементы.Отходы.ТекущиеДанные;
	//ТекущиеДанные.СуммаВозможногоИспользования = ТекущиеДанные.Количество * ТекущиеДанные.СтоимостьВозможногоИспользования;
    ОтходыКоличествоПриИзменении(Неопределено);
КонецПроцедуры

&НаКлиенте
Процедура ОтходыПрямыеЗатратыПриИзменении(Элемент)
	ТекущиеДанные = Элементы.Отходы.ТекущиеДанные;
	ТекущиеДанные.СуммаПлановоУчетная = ТекущиеДанные.Количество * ТекущиеДанные.ПрямыеЗатраты;
	ТекущиеДанные.КУдержанию = ТекущиеДанные.СуммаПлановоУчетная -  ТекущиеДанные.СуммаВозможногоИспользования;
КонецПроцедуры

&НаКлиенте
Процедура ДанныеОБракеСотрудникНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Если ЗначениеЗаполнено(Объект.Смена) Тогда
		
		СотрудникиОтбора = ПолучитьСотрудниковОтбораНаСервере();
		
		Если СотрудникиОтбора.Количество() <> 0 
			И ТипЗнч(СотрудникиОтбора[0].Значение) = Тип("СправочникСсылка.Сотрудники") Тогда
		
			ФормаВыбора = ПолучитьФорму("Справочник.Сотрудники.ФормаВыбора",, Элемент);
		
		ИначеЕсли СотрудникиОтбора.Количество() <> 0 
			И ТипЗнч(СотрудникиОтбора[0].Значение) = Тип("СправочникСсылка.ФизическиеЛица") Тогда 
			
			//ПараметрыОтркытия = Новый Структура;
			//ПараметрыОтркытия.Вставить("Организация", ОбщегоНазначенияУТВызовСервера.ЗначениеРеквизитаОбъекта(Объект.ЗаказНаПроизводство, "Организация"));
			                            
			ФормаВыбора = ПолучитьФорму("Справочник.ФизическиеЛица.Форма.ФормаВыбораУП",, Элемент);
			
		Иначе
			  
			ФормаВыбора = ПолучитьФорму("Справочник.Сотрудники.ФормаВыбора",, Элемент);
			
		КонецЕсли;
		
		ЭлементОтбора = ФормаВыбора.Список.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		ЭлементОтбора.ЛевоеЗначение     = Новый ПолеКомпоновкиДанных ("Ссылка");
		ЭлементОтбора.ВидСравнения      = ВидСравненияКомпоновкиДанных.ВСписке;
		ЭлементОтбора.ПравоеЗначение     = СотрудникиОтбора;
		ЭлементОтбора.Использование      = Истина;
		ЭлементОтбора.РежимОтображения     = РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный;
		
		ФормаВыбора.Открыть();	
		
		
		
	Иначе
		
		ТекстСообщения = "Сменное задание не выбрано!";
		ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОтходыМатериалыПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.Отходы.ТекущиеДанные;
	
	Если ТекущиеДанные <> Неопределено Тогда
		
		ТекущиеДанные.ПрямыеЗатраты = ПолучитьСуммуПрямыхЗатрат(ТекущиеДанные.Материал);
		ОтходыКоличествоПриИзменении(Неопределено);
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ПолучитьСуммуПрямыхЗатрат(Номенклатура, БезОтбораПоСтатьям = Ложь)   
	
	ОсновнаяСпецификация = ПолучитьОсновнуюСпецификацию(Номенклатура, Объект.Дата);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПлановыеМатериальныеЗатратыОбороты.Калькуляция КАК Калькуляция,
		|	ПлановыеМатериальныеЗатратыОбороты.ПартияСпецификация КАК ПартияСпецификация,
		|	МАКСИМУМ(ПлановыеМатериальныеЗатратыОбороты.Калькуляция.Дата) КАК КалькуляцияДата
		|ПОМЕСТИТЬ вт_ПлановыеМатериальныеЗатраты
		|ИЗ
		|	РегистрНакопления.ПлановыеМатериальныеЗатраты.Обороты КАК ПлановыеМатериальныеЗатратыОбороты
		|ГДЕ
		|	ПлановыеМатериальныеЗатратыОбороты.ПартияСпецификация = &ПартияСпецификация
		|	И ПлановыеМатериальныеЗатратыОбороты.Калькуляция.Дата <= &ДатаДокумента
		|
		|СГРУППИРОВАТЬ ПО
		|	ПлановыеМатериальныеЗатратыОбороты.ПартияСпецификация,
		|	ПлановыеМатериальныеЗатратыОбороты.Калькуляция
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ПлановыеПрочиеЗатратыОбороты.Калькуляция КАК Калькуляция,
		|	ПлановыеПрочиеЗатратыОбороты.ПартияСпецификация КАК ПартияСпецификация,
		|	МАКСИМУМ(ПлановыеПрочиеЗатратыОбороты.Калькуляция.Дата) КАК КалькуляцияДата
		|ПОМЕСТИТЬ вт_ПлановыеПрочиеЗатраты
		|ИЗ
		|	РегистрНакопления.ПлановыеПрочиеЗатраты.Обороты(, , , ) КАК ПлановыеПрочиеЗатратыОбороты
		|ГДЕ
		|	ПлановыеПрочиеЗатратыОбороты.ПартияСпецификация = &ПартияСпецификация
		|	И ПлановыеПрочиеЗатратыОбороты.Калькуляция.Дата <= &ДатаДокумента
		|
		|СГРУППИРОВАТЬ ПО
		|	ПлановыеПрочиеЗатратыОбороты.ПартияСпецификация,
		|	ПлановыеПрочиеЗатратыОбороты.Калькуляция
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ПлановыеТрудозатратыОбороты.Калькуляция КАК Калькуляция,
		|	ПлановыеТрудозатратыОбороты.ПартияСпецификация КАК ПартияСпецификация,
		|	МАКСИМУМ(ПлановыеТрудозатратыОбороты.Калькуляция.Дата) КАК КалькуляцияДата
		|ПОМЕСТИТЬ вт_ПлановыеТрудозатратыОбороты
		|ИЗ
		|	РегистрНакопления.ПлановыеТрудозатраты.Обороты(, , , ) КАК ПлановыеТрудозатратыОбороты
		|ГДЕ
		|	ПлановыеТрудозатратыОбороты.ПартияСпецификация = &ПартияСпецификация
		|	И ПлановыеТрудозатратыОбороты.Калькуляция.Дата <= &ДатаДокумента
		|
		|СГРУППИРОВАТЬ ПО
		|	ПлановыеТрудозатратыОбороты.ПартияСпецификация,
		|	ПлановыеТрудозатратыОбороты.Калькуляция
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	вт_ПлановыеМатериальныеЗатраты.Калькуляция КАК Калькуляция,
		|	вт_ПлановыеМатериальныеЗатраты.ПартияСпецификация КАК ПартияСпецификация,
		|	вт_ПлановыеМатериальныеЗатраты.КалькуляцияДата КАК КалькуляцияДата,
		|	СУММА(ЕСТЬNULL(ПлановыеМатериальныеЗатратыОбороты.СтоимостьБезНДСОборот, 0)) КАК СтоимостьОборот
		|ПОМЕСТИТЬ вт_Итого
		|ИЗ
		|	вт_ПлановыеМатериальныеЗатраты КАК вт_ПлановыеМатериальныеЗатраты
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ПлановыеМатериальныеЗатраты.Обороты КАК ПлановыеМатериальныеЗатратыОбороты
		|		ПО вт_ПлановыеМатериальныеЗатраты.Калькуляция = ПлановыеМатериальныеЗатратыОбороты.Калькуляция
		|			И вт_ПлановыеМатериальныеЗатраты.КалькуляцияДата = ПлановыеМатериальныеЗатратыОбороты.Калькуляция.Дата
		|			И вт_ПлановыеМатериальныеЗатраты.ПартияСпецификация = ПлановыеМатериальныеЗатратыОбороты.ПартияСпецификация
		|ГДЕ
		|	ВЫБОР
		|			КОГДА &БезОтбораПоСтатьям
		|				ТОГДА ИСТИНА
		|			ИНАЧЕ ПлановыеМатериальныеЗатратыОбороты.СтатьяКалькуляции В (&СтатьяКалькуляции)
		|		КОНЕЦ
		|
		|СГРУППИРОВАТЬ ПО
		|	вт_ПлановыеМатериальныеЗатраты.ПартияСпецификация,
		|	вт_ПлановыеМатериальныеЗатраты.Калькуляция,
		|	вт_ПлановыеМатериальныеЗатраты.КалькуляцияДата
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	вт_ПлановыеПрочиеЗатраты.Калькуляция,
		|	вт_ПлановыеПрочиеЗатраты.ПартияСпецификация,
		|	вт_ПлановыеПрочиеЗатраты.КалькуляцияДата,
		|	СУММА(ЕСТЬNULL(ПлановыеПрочиеЗатратыОбороты.СтоимостьБезНДСОборот, 0))
		|ИЗ
		|	вт_ПлановыеПрочиеЗатраты КАК вт_ПлановыеПрочиеЗатраты
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ПлановыеПрочиеЗатраты.Обороты(, , , ) КАК ПлановыеПрочиеЗатратыОбороты
		|		ПО вт_ПлановыеПрочиеЗатраты.Калькуляция = ПлановыеПрочиеЗатратыОбороты.Калькуляция
		|			И вт_ПлановыеПрочиеЗатраты.КалькуляцияДата = ПлановыеПрочиеЗатратыОбороты.Калькуляция.Дата
		|			И вт_ПлановыеПрочиеЗатраты.ПартияСпецификация = ПлановыеПрочиеЗатратыОбороты.ПартияСпецификация
		|ГДЕ
		|	ВЫБОР
		|			КОГДА &БезОтбораПоСтатьям
		|				ТОГДА ИСТИНА
		|			ИНАЧЕ ПлановыеПрочиеЗатратыОбороты.СтатьяКалькуляции В (&СтатьяКалькуляции)
		|		КОНЕЦ
		|
		|СГРУППИРОВАТЬ ПО
		|	вт_ПлановыеПрочиеЗатраты.ПартияСпецификация,
		|	вт_ПлановыеПрочиеЗатраты.Калькуляция,
		|	вт_ПлановыеПрочиеЗатраты.КалькуляцияДата
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	вт_ПлановыеТрудозатратыОбороты.Калькуляция,
		|	вт_ПлановыеТрудозатратыОбороты.ПартияСпецификация,
		|	вт_ПлановыеТрудозатратыОбороты.КалькуляцияДата,
		|	СУММА(ЕСТЬNULL(ПлановыеТрудозатратыОбороты.СтоимостьОборот, 0))
		|ИЗ
		|	вт_ПлановыеТрудозатратыОбороты КАК вт_ПлановыеТрудозатратыОбороты
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ПлановыеТрудозатраты.Обороты(, , , ) КАК ПлановыеТрудозатратыОбороты
		|		ПО вт_ПлановыеТрудозатратыОбороты.Калькуляция = ПлановыеТрудозатратыОбороты.Калькуляция
		|			И вт_ПлановыеТрудозатратыОбороты.КалькуляцияДата = ПлановыеТрудозатратыОбороты.Калькуляция.Дата
		|			И вт_ПлановыеТрудозатратыОбороты.ПартияСпецификация = ПлановыеТрудозатратыОбороты.ПартияСпецификация
		|ГДЕ
		|	ВЫБОР
		|			КОГДА &БезОтбораПоСтатьям
		|				ТОГДА ИСТИНА
		|			ИНАЧЕ ПлановыеТрудозатратыОбороты.СтатьяКалькуляции В (&СтатьяКалькуляции)
		|		КОНЕЦ
		|
		|СГРУППИРОВАТЬ ПО
		|	вт_ПлановыеТрудозатратыОбороты.ПартияСпецификация,
		|	вт_ПлановыеТрудозатратыОбороты.Калькуляция,
		|	вт_ПлановыеТрудозатратыОбороты.КалькуляцияДата
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	СУММА(вт_Итого.СтоимостьОборот) КАК СтоимостьОборот
		|ИЗ
		|	вт_Итого КАК вт_Итого";
	
	Запрос.УстановитьПараметр("ДатаДокумента", Объект.Дата);
	Запрос.УстановитьПараметр("ПартияСпецификация", ОсновнаяСпецификация);
	Запрос.УстановитьПараметр("СтатьяКалькуляции", Справочники.бит_ЗначенияПоУмолчанию.ПолучитьМассивЗначений(Справочники.бит_ЗначенияПоУмолчанию.ПрямыеЗатратыВАктахБрака, ЭтотОбъект));
	Запрос.УстановитьПараметр("БезОтбораПоСтатьям", БезОтбораПоСтатьям);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Возврат ВыборкаДетальныеЗаписи.СтоимостьОборот
	КонецЦикла;
	
	Возврат 0;

КонецФункции  

&НаСервере
Функция ПолучитьОсновнуюСпецификацию(Номенклатура, НачалоПроизводства)
	
	ПараметрыВыбораСпецификаций = УправлениеДаннымиОбИзделияхКлиентСервер.ПараметрыВыбораСпецификаций();
	ПараметрыВыбораСпецификаций.Вставить("ПолучитьСпецификацииПоНоменклатуре", Истина);
	ПараметрыВыбораСпецификаций.Вставить("ПолучитьСпецификацииПоСпискуНоменклатуры", Ложь);
	ПараметрыВыбораСпецификаций.Вставить("ИгнорируемыеПараметрыНазначения", Новый Массив);
	ПараметрыВыбораСпецификаций.Вставить("ИгнорируемыеУточненияПрименения", Новый Массив);
	
	ДанныеОбИзделии = УправлениеДаннымиОбИзделияхКлиентСервер.СтруктураДанныхОбИзделииДляВыбораСпецификации();
	ДанныеОбИзделии.Номенклатура = Номенклатура;	
	ДанныеОбИзделии.НачалоПроизводства = НачалоПроизводства;
	
	Результат = УправлениеДаннымиОбИзделиях.СпецификацииИзделия(ДанныеОбИзделии, ПараметрыВыбораСпецификаций);
	
	ИсключитьСпецификацию = Справочники.РесурсныеСпецификации.ПустаяСсылка();
	
	Спецификации             = Новый Массив;
	ПриоритетнаяСпецификация = Справочники.РесурсныеСпецификации.ПустаяСсылка();
	
	Для Индекс = 0 По Результат.ВГраница() Цикл
		ТекущаяСпецификация = Результат[Индекс].Спецификация;
		Если ПриоритетнаяСпецификация.Пустая()
				И Результат[Индекс].ПодбираетсяАвтоматически = Истина Тогда
			ПриоритетнаяСпецификация = ТекущаяСпецификация;
		КонецЕсли;
		Если ТекущаяСпецификация <> ИсключитьСпецификацию Тогда
			Спецификации.Добавить(ТекущаяСпецификация);
		КонецЕсли;
	КонецЦикла;	
	
	Возврат ПриоритетнаяСпецификация;
	
КонецФункции

&НаСервере
Процедура ВосстановлениеПриИзмененииНаСервере()
	
	ИтогоКУдержанию = 0;
	
	Для Каждого СтрокаТЧ Из Объект.Восстановление Цикл
		ИтогоКУдержанию = ИтогоКУдержанию + СтрокаТЧ.Сумма;
	КонецЦикла;                                            
	
	Объект.ИтогоКУдержаниюВосстановление = ИтогоКУдержанию;
	
КонецПроцедуры

&НаКлиенте
Процедура ВосстановлениеПриИзменении(Элемент)
	ВосстановлениеПриИзмененииНаСервере();
КонецПроцедуры

&НаСервере
Процедура ОтходыПриИзмененииНаСервере()
	
	ИтогоКУдержанию = 0;
	
	Для Каждого СтрокаТЧ Из Объект.Отходы Цикл
		ИтогоКУдержанию = ИтогоКУдержанию + СтрокаТЧ.КУдержанию;
	КонецЦикла;                                            
	
	Объект.ИтогоКУдержаниюОтходы = ИтогоКУдержанию;
	
КонецПроцедуры

&НаКлиенте
Процедура ОтходыПриИзменении(Элемент)
	ОтходыПриИзмененииНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ПеремаркировкаКоличествоПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.Перемаркировка.ТекущиеДанные;
	
	Если ТекущиеДанные <> Неопределено Тогда
		
		ТекущиеДанные.КУдержанию = (ТекущиеДанные.ПолнаяСебестоимостьЗабракованнойНоменклатуры - ТекущиеДанные.ПолнаяСебестоимостьПеремаркированнойНоменклатуры) * ТекущиеДанные.Количество;
			
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПеремаркировкаНоменклатураЗабракованнаяПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.Перемаркировка.ТекущиеДанные;
	
	Если ТекущиеДанные <> Неопределено Тогда
		
		ТекущиеДанные.ПолнаяСебестоимостьЗабракованнойНоменклатуры = ПолучитьСуммуПрямыхЗатрат(ТекущиеДанные.НоменклатураЗабракованная, Истина);
		ПеремаркировкаКоличествоПриИзменении(Неопределено);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПеремаркировкаПеремаркированоВПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.Перемаркировка.ТекущиеДанные;
	
	Если ТекущиеДанные <> Неопределено Тогда
		
		ТекущиеДанные.ПолнаяСебестоимостьПеремаркированнойНоменклатуры = ПолучитьСуммуПрямыхЗатрат(ТекущиеДанные.ПеремаркированоВ, Истина);
		ПеремаркировкаКоличествоПриИзменении(Неопределено);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПеремаркировкаПриИзменении(Элемент)
	
	ИтогоКУдержанию = 0;
	
	Для Каждого СтрокаТЧ Из Объект.Перемаркировка Цикл
		ИтогоКУдержанию = ИтогоКУдержанию + СтрокаТЧ.КУдержанию;
	КонецЦикла;                                            
	
	Объект.ИтогоКУдержаниюПеремаркировка = ИтогоКУдержанию;
	
КонецПроцедуры

&НаСервере
Процедура РассчитатьСуммуНаСервере()
	Объект.ОбщийУщербКУдержанию = Объект.ИтогоКУдержаниюОтходы + Объект.ИтогоКУдержаниюВосстановление + Объект.ИтогоКУдержаниюПеремаркировка;
КонецПроцедуры

&НаКлиенте
Процедура РассчитатьСумму(Команда)
	РассчитатьСуммуНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ОтходыСуммаПлановоУчетнаяПриИзменении(Элемент)
	ОтходыКоличествоПриИзменении(Неопределено);
КонецПроцедуры
